app/controllers/projects_controller.rb

INSERT INTO "projects" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 24 Dec 2013 22:03:59 UTC +00:00], ["name", "new"], ["updated_at", Tue, 24 Dec 2013 22:03:59 UTC +00:00]]
---
  def create
    @project = Project.new(project_params)

      if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "16"]]
UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = 16  [["name", "tesalate"], ["updated_at", Wed, 25 Dec 2013 21:00:54 UTC +00:00]]
---
  def update
    @project = Project.find(params[:id])

      if @project.update_attributes(project_params)