app/controllers/project_controller.rb

INSERT INTO "projects" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 20 Dec 2013 14:31:30 UTC +00:00], ["name", "testttt"], ["updated_at", Fri, 20 Dec 2013 14:31:30 UTC +00:00]]
---
  def create
    @project = Project.new(project_params)

      if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = 1  [["name", "project1d"], ["updated_at", Fri, 20 Dec 2013 14:29:14 UTC +00:00]]
---
  def update
    @project = Project.find(params[:id])

      if @project.update_attributes(project_params)